//? Створити розмітку з двома текстовими полями та кнопкою.
//? При натисканні на кнопку перевіряти, чи обидва поля містять значення,
//? якщо так, то виводити повідомлення "Обидва поля заповнені",
//? якщо ні — "Не всі поля заповнені".

//! Код виконаного завдання

// let form1 = prompt("Заповніть цю форму");    

// let formFirst = prompt("Заповніть цю форму");

// if (form1 && formFirst) {
//     alert("Обидва поля заповнені")
// } else {
//     alert("Не всі поля заповнені")
// } ; 

//? Створити розмітку з двома числовими полями та кнопкою.При натисканні на кнопку перевіряти,
//? чи сума значень полів більша за 10, якщо так, то виводити
//?  повідомлення "Сума більша за 10", якщо ні — "Сума менша або дорівнює 10".

//! Код виконаного завдання

const form2 = Number(prompt("Введіть енну кількість значень"));
const formSecond = Number(prompt("Введіть енну кількість значень"));

if (form2 > 10 && formSecond > 10 ) {
    alert("Сума більша за 10");
} else if (isNaN(form2) || isNaN(formSecond)) {
    alert("Це не число");
} else {
    alert("Сума менша або дорівнює 10");
}

//? Створити розмітку з текстовим полем та кнопкою.При натисканні на кнопку перевіряти,
//?     чи введений текст містить слово "JavaScript", якщо так, то виводити повідомлення
//?  "Текст містить слово JavaScript", якщо ні — "Текст не містить слово JavaScript".

//! Код виконаного завдання

// const form3 = prompt("Заповніть форму");

// console.log(form3.includes("JavaScript"));

// if (form3.includes("JavaScript")) {
//     alert("Текст містить слово JavaScript")
// } else {
//     alert("Текст не містить слово JavaScript")
// };


//? Створити розмітку з формою з полями введення та кнопкою.
//? При натисканні на кнопку перевіряти, чи введене число більше
//?  за 10 та менше за 20, якщо так, то виводити повідомлення "Число входить в діапазон від 10 до 20",
//?     якщо ні — "Число не входить в діапазон від 10 до 20".

//! Код виконаного завдання

// const form4 = prompt("Введіть число");

// if (form4 > 10 && form4 < 20) {
//     alert("Число входить в діапазон від 10 до 20")
// } else {
//    alert("Число не входить в діапазон від 10 до 20")
// };


//? Створити розмітку з формою з полями введення та кнопкою.
//? При натисканні на кнопку перевіряти, чи введені дані правильно заповнені,
//? якщо так, то перенаправляти на іншу сторінку,
//? якщо ні — виводити повідомлення про помилку.
//? Правильно заповнені дані: ім'я містить не менше 3 символів, email містить символ @ та крапку після неї,
//? пароль містить не менше 6 символів.

//! Код виконаного завдання

// console.log("Завдання 5");

// const form5 = prompt("Введіть ім'я")

// if (form5.length < 3) {
//     alert("Ім'я має містити 3 символи або більше!")
// } else {
//     alert("Вітаємо!")
// };

// const form6 = prompt("Введіть email")

// if (form6.includes("@") && form6.includes(".")) {
//     alert("Вітаємо!")
// } else {
//     alert(`Email повинен містити "@" та "."`)
// };

// const form7 = prompt("Введіть пароль")

// if (form7.length < 6) {
//     alert("Пароль має містити 6 символів або більше!")
// } else {
//     alert("Вітаємо!")
// };